{
  "_class_name": "LDMSuperResolutionPipeline",
  "_diffusers_version": "0.8.0.dev0",
  "scheduler": [
    "diffusers",
    "DDIMScheduler"
  ],
  "unet": [
    "diffusers",
    "UNet2DModel"
  ],
  "vqvae": [
    "diffusers",
    "VQModel"
  ]
}
