{
  "_class_name": "DDIMScheduler",
  "_diffusers_version": "0.8.0.dev0",
  "beta_end": 0.0155,
  "beta_schedule": "scaled_linear",
  "beta_start": 0.0015,
  "clip_sample": false,
  "num_train_timesteps": 1000,
  "set_alpha_to_one": true,
  "steps_offset": 1,
  "trained_betas": null
}
